zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_PMA_MMD.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_PMA_MMD.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_PMA_MMD
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_PMA_MMD_H_)  /* Check if memory map has not been already included */
#define S32K566_PMA_MMD_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- PMA_MMD Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PMA_MMD_Peripheral_Access_Layer PMA_MMD Peripheral Access Layer
 * @{
 */

/** PMA_MMD - Register Layout Typedef */
typedef struct PMA_MMD_Struct {
  __IO uint16_t SR_PMA_CTRL1;                      /**< SR PMA MMD Control1 Register, offset: 0x0 */
  __I  uint16_t SR_PMA_STATUS1;                    /**< SR PMA MMD Status1 Register, offset: 0x2 */
  __I  uint16_t SR_PMA_DEV_ID_1;                   /**< SR PMA MMD Device Identifier 1 Register, offset: 0x4 */
  __I  uint16_t SR_PMA_DEV_ID_2;                   /**< SR PMA MMD Device Identifier 2 Register, offset: 0x6 */
  __I  uint16_t SR_PMA_SPD_ABL;                    /**< SR PMA MMD Speed Ability Register, offset: 0x8 */
  __I  uint16_t SR_PMA_DEV_PKG1;                   /**< SR PMA MMD Devices in Package 1 Register, offset: 0xA */
  __I  uint16_t SR_PMA_DEV_PKG2;                   /**< SR PMA MMD Devices in Package 2 Register, offset: 0xC */
  __IO uint16_t SR_PMA_CTRL2;                      /**< SR PMA MMD Control2 Register, offset: 0xE */
  __I  uint16_t SR_PMA_STATUS2;                    /**< SR PMA MMD Status2 Register, offset: 0x10 */
  __IO uint16_t SR_PMA_TX_DIS;                     /**< SR_PMA_TX_DIS, offset: 0x12 */
  __I  uint16_t SR_PMA_RX_SIG_DET;                 /**< SR PMA MMD Receive Signal Detect Register, offset: 0x14 */
  __I  uint16_t SR_PMA_EXT_ABL;                    /**< SR PMA or PMD Extended Ability Register, offset: 0x16 */
  uint8_t RESERVED_0[4];
  __I  uint16_t SR_PMA_PKG1;                       /**< SR PMA MMD Package Identifier 1 Register, offset: 0x1C */
  __I  uint16_t SR_PMA_PKG2;                       /**< SR PMA MMD Package Identifier 2 Register, offset: 0x1E */
  uint8_t RESERVED_1[10];
  __I  uint16_t SR_PMA_2PT5G_5G_EXT_ABL;           /**< SR PMA MMD 2., offset: 0x2A */
  uint8_t RESERVED_2[276];
  __IO uint16_t SR_PMA_KX_CTRL;                    /**< SR PMA or PMD KX Control Register This register is present only in the configurations with KX_Present mode., offset: 0x140 */
  __I  uint16_t SR_PMA_KX_STS;                     /**< SR PMA or PMD KX Status Register This register is present only in the configurations with KX_Present mode., offset: 0x142 */
  uint8_t RESERVED_3[3276];
  __I  uint16_t SR_PMA_TIME_SYNC_PMA_ABL;          /**< SR PMA MMD Time Sync Capability Register, offset: 0xE10 */
  __I  uint16_t SR_PMA_TIME_SYNC_TX_MAX_DLY_LWR;   /**< SR PMA MMD Time Sync Tx Max Delay Lower Register, offset: 0xE12 */
  __I  uint16_t SR_PMA_TIME_SYNC_TX_MAX_DLY_UPR;   /**< SR PMA MMD Time Sync Tx Max Delay Upper Register, offset: 0xE14 */
  __I  uint16_t SR_PMA_TIME_SYNC_TX_MIN_DLY_LWR;   /**< SR PMA MMD Time Sync Tx Min Delay Lower Register, offset: 0xE16 */
  __I  uint16_t SR_PMA_TIME_SYNC_TX_MIN_DLY_UPR;   /**< SR PMA MMD Time Sync Tx Min Delay Upper Register, offset: 0xE18 */
  __I  uint16_t SR_PMA_TIME_SYNC_RX_MAX_DLY_LWR;   /**< SR PMA MMD Time Sync Rx Max Delay Lower Register, offset: 0xE1A */
  __I  uint16_t SR_PMA_TIME_SYNC_RX_MAX_DLY_UPR;   /**< SR PMA MMD Time Sync Rx Max Delay Upper Register, offset: 0xE1C */
  __I  uint16_t SR_PMA_TIME_SYNC_RX_MIN_DLY_LWR;   /**< SR PMA MMD Time Sync Rx Min Delay Lower Register, offset: 0xE1E */
  __I  uint16_t SR_PMA_TIME_SYNC_RX_MIN_DLY_UPR;   /**< SR PMA MMD Time Sync Rx Min Delay Upper Register, offset: 0xE20 */
  uint8_t RESERVED_4[61918];
  __IO uint16_t VR_PMA_DIG_CTRL1;                  /**< VR PMA MMD Digital Control1 Register, offset: 0x10000 */
  uint8_t RESERVED_5[30];
  __I  uint16_t VR_PMA_DIG_STS;                    /**< VR PMA MMD Digital Status Register, offset: 0x10020 */
} PMA_MMD_Type, *PMA_MMD_MemMapPtr;

/** Number of instances of the PMA_MMD module. */
#define PMA_MMD_INSTANCE_COUNT                   (1u)

/* PMA_MMD - Peripheral instance base addresses */
/** Peripheral NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__PMA_MMD base address */
#define IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__PMA_MMD_BASE (0x81003Eu)
/** Peripheral NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__PMA_MMD base pointer */
#define IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__PMA_MMD ((PMA_MMD_Type *)IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__PMA_MMD_BASE)
/** Array initializer of PMA_MMD peripheral base addresses */
#define IP_PMA_MMD_BASE_ADDRS                    { IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__PMA_MMD_BASE }
/** Array initializer of PMA_MMD peripheral base pointers */
#define IP_PMA_MMD_BASE_PTRS                     { IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__PMA_MMD }

/* ----------------------------------------------------------------------------
   -- PMA_MMD Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PMA_MMD_Register_Masks PMA_MMD Register Masks
 * @{
 */

/*! @name SR_PMA_CTRL1 - SR PMA MMD Control1 Register */
/*! @{ */

#define PMA_MMD_SR_PMA_CTRL1_LB_MASK             (0x1U)
#define PMA_MMD_SR_PMA_CTRL1_LB_SHIFT            (0U)
#define PMA_MMD_SR_PMA_CTRL1_LB_WIDTH            (1U)
#define PMA_MMD_SR_PMA_CTRL1_LB(x)               (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_CTRL1_LB_SHIFT)) & PMA_MMD_SR_PMA_CTRL1_LB_MASK)

#define PMA_MMD_SR_PMA_CTRL1_SS_5_2_MASK         (0x3CU)
#define PMA_MMD_SR_PMA_CTRL1_SS_5_2_SHIFT        (2U)
#define PMA_MMD_SR_PMA_CTRL1_SS_5_2_WIDTH        (4U)
#define PMA_MMD_SR_PMA_CTRL1_SS_5_2(x)           (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_CTRL1_SS_5_2_SHIFT)) & PMA_MMD_SR_PMA_CTRL1_SS_5_2_MASK)

#define PMA_MMD_SR_PMA_CTRL1_SS6_MASK            (0x40U)
#define PMA_MMD_SR_PMA_CTRL1_SS6_SHIFT           (6U)
#define PMA_MMD_SR_PMA_CTRL1_SS6_WIDTH           (1U)
#define PMA_MMD_SR_PMA_CTRL1_SS6(x)              (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_CTRL1_SS6_SHIFT)) & PMA_MMD_SR_PMA_CTRL1_SS6_MASK)

