zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_PMA_MMD.h
#define PMA_MMD_SR_PMA_CTRL1_LPM_MASK            (0x800U)
#define PMA_MMD_SR_PMA_CTRL1_LPM_SHIFT           (11U)
#define PMA_MMD_SR_PMA_CTRL1_LPM_WIDTH           (1U)
#define PMA_MMD_SR_PMA_CTRL1_LPM(x)              (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_CTRL1_LPM_SHIFT)) & PMA_MMD_SR_PMA_CTRL1_LPM_MASK)

#define PMA_MMD_SR_PMA_CTRL1_SS13_MASK           (0x2000U)
#define PMA_MMD_SR_PMA_CTRL1_SS13_SHIFT          (13U)
#define PMA_MMD_SR_PMA_CTRL1_SS13_WIDTH          (1U)
#define PMA_MMD_SR_PMA_CTRL1_SS13(x)             (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_CTRL1_SS13_SHIFT)) & PMA_MMD_SR_PMA_CTRL1_SS13_MASK)

#define PMA_MMD_SR_PMA_CTRL1_RST_MASK            (0x8000U)
#define PMA_MMD_SR_PMA_CTRL1_RST_SHIFT           (15U)
#define PMA_MMD_SR_PMA_CTRL1_RST_WIDTH           (1U)
#define PMA_MMD_SR_PMA_CTRL1_RST(x)              (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_CTRL1_RST_SHIFT)) & PMA_MMD_SR_PMA_CTRL1_RST_MASK)
/*! @} */

/*! @name SR_PMA_STATUS1 - SR PMA MMD Status1 Register */
/*! @{ */

#define PMA_MMD_SR_PMA_STATUS1_LPMS_MASK         (0x2U)
#define PMA_MMD_SR_PMA_STATUS1_LPMS_SHIFT        (1U)
#define PMA_MMD_SR_PMA_STATUS1_LPMS_WIDTH        (1U)
#define PMA_MMD_SR_PMA_STATUS1_LPMS(x)           (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_STATUS1_LPMS_SHIFT)) & PMA_MMD_SR_PMA_STATUS1_LPMS_MASK)

#define PMA_MMD_SR_PMA_STATUS1_RLU_MASK          (0x4U)
#define PMA_MMD_SR_PMA_STATUS1_RLU_SHIFT         (2U)
#define PMA_MMD_SR_PMA_STATUS1_RLU_WIDTH         (1U)
#define PMA_MMD_SR_PMA_STATUS1_RLU(x)            (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_STATUS1_RLU_SHIFT)) & PMA_MMD_SR_PMA_STATUS1_RLU_MASK)

#define PMA_MMD_SR_PMA_STATUS1_FLT_MASK          (0x80U)
#define PMA_MMD_SR_PMA_STATUS1_FLT_SHIFT         (7U)
#define PMA_MMD_SR_PMA_STATUS1_FLT_WIDTH         (1U)
#define PMA_MMD_SR_PMA_STATUS1_FLT(x)            (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_STATUS1_FLT_SHIFT)) & PMA_MMD_SR_PMA_STATUS1_FLT_MASK)
/*! @} */

/*! @name SR_PMA_DEV_ID_1 - SR PMA MMD Device Identifier 1 Register */
/*! @{ */

#define PMA_MMD_SR_PMA_DEV_ID_1_PMA_DEV_OUI_3_18_MASK (0xFFFFU)
#define PMA_MMD_SR_PMA_DEV_ID_1_PMA_DEV_OUI_3_18_SHIFT (0U)
#define PMA_MMD_SR_PMA_DEV_ID_1_PMA_DEV_OUI_3_18_WIDTH (16U)
#define PMA_MMD_SR_PMA_DEV_ID_1_PMA_DEV_OUI_3_18(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_DEV_ID_1_PMA_DEV_OUI_3_18_SHIFT)) & PMA_MMD_SR_PMA_DEV_ID_1_PMA_DEV_OUI_3_18_MASK)
/*! @} */

/*! @name SR_PMA_DEV_ID_2 - SR PMA MMD Device Identifier 2 Register */
/*! @{ */

#define PMA_MMD_SR_PMA_DEV_ID_2_PMA_DEV_RN_3_0_MASK (0xFU)
#define PMA_MMD_SR_PMA_DEV_ID_2_PMA_DEV_RN_3_0_SHIFT (0U)
#define PMA_MMD_SR_PMA_DEV_ID_2_PMA_DEV_RN_3_0_WIDTH (4U)
#define PMA_MMD_SR_PMA_DEV_ID_2_PMA_DEV_RN_3_0(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_DEV_ID_2_PMA_DEV_RN_3_0_SHIFT)) & PMA_MMD_SR_PMA_DEV_ID_2_PMA_DEV_RN_3_0_MASK)

#define PMA_MMD_SR_PMA_DEV_ID_2_PMA_DEV_MMN_5_0_MASK (0x3F0U)
#define PMA_MMD_SR_PMA_DEV_ID_2_PMA_DEV_MMN_5_0_SHIFT (4U)
#define PMA_MMD_SR_PMA_DEV_ID_2_PMA_DEV_MMN_5_0_WIDTH (6U)
#define PMA_MMD_SR_PMA_DEV_ID_2_PMA_DEV_MMN_5_0(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_DEV_ID_2_PMA_DEV_MMN_5_0_SHIFT)) & PMA_MMD_SR_PMA_DEV_ID_2_PMA_DEV_MMN_5_0_MASK)

#define PMA_MMD_SR_PMA_DEV_ID_2_PMA_DEV_OUI_19_24_MASK (0xFC00U)
#define PMA_MMD_SR_PMA_DEV_ID_2_PMA_DEV_OUI_19_24_SHIFT (10U)
#define PMA_MMD_SR_PMA_DEV_ID_2_PMA_DEV_OUI_19_24_WIDTH (6U)
#define PMA_MMD_SR_PMA_DEV_ID_2_PMA_DEV_OUI_19_24(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_DEV_ID_2_PMA_DEV_OUI_19_24_SHIFT)) & PMA_MMD_SR_PMA_DEV_ID_2_PMA_DEV_OUI_19_24_MASK)
/*! @} */

/*! @name SR_PMA_SPD_ABL - SR PMA MMD Speed Ability Register */
/*! @{ */

#define PMA_MMD_SR_PMA_SPD_ABL_XGC_MASK          (0x1U)
#define PMA_MMD_SR_PMA_SPD_ABL_XGC_SHIFT         (0U)
#define PMA_MMD_SR_PMA_SPD_ABL_XGC_WIDTH         (1U)
#define PMA_MMD_SR_PMA_SPD_ABL_XGC(x)            (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_SPD_ABL_XGC_SHIFT)) & PMA_MMD_SR_PMA_SPD_ABL_XGC_MASK)

#define PMA_MMD_SR_PMA_SPD_ABL_GC_MASK           (0x10U)
#define PMA_MMD_SR_PMA_SPD_ABL_GC_SHIFT          (4U)
#define PMA_MMD_SR_PMA_SPD_ABL_GC_WIDTH          (1U)
#define PMA_MMD_SR_PMA_SPD_ABL_GC(x)             (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_SPD_ABL_GC_SHIFT)) & PMA_MMD_SR_PMA_SPD_ABL_GC_MASK)
/*! @} */

/*! @name SR_PMA_DEV_PKG1 - SR PMA MMD Devices in Package 1 Register */
/*! @{ */

#define PMA_MMD_SR_PMA_DEV_PKG1_CLS22_MASK       (0x1U)
#define PMA_MMD_SR_PMA_DEV_PKG1_CLS22_SHIFT      (0U)
#define PMA_MMD_SR_PMA_DEV_PKG1_CLS22_WIDTH      (1U)
#define PMA_MMD_SR_PMA_DEV_PKG1_CLS22(x)         (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_DEV_PKG1_CLS22_SHIFT)) & PMA_MMD_SR_PMA_DEV_PKG1_CLS22_MASK)

#define PMA_MMD_SR_PMA_DEV_PKG1_PMA_PMD_MASK     (0x2U)
#define PMA_MMD_SR_PMA_DEV_PKG1_PMA_PMD_SHIFT    (1U)
#define PMA_MMD_SR_PMA_DEV_PKG1_PMA_PMD_WIDTH    (1U)
#define PMA_MMD_SR_PMA_DEV_PKG1_PMA_PMD(x)       (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_DEV_PKG1_PMA_PMD_SHIFT)) & PMA_MMD_SR_PMA_DEV_PKG1_PMA_PMD_MASK)

#define PMA_MMD_SR_PMA_DEV_PKG1_WIS_MASK         (0x4U)
#define PMA_MMD_SR_PMA_DEV_PKG1_WIS_SHIFT        (2U)
#define PMA_MMD_SR_PMA_DEV_PKG1_WIS_WIDTH        (1U)
#define PMA_MMD_SR_PMA_DEV_PKG1_WIS(x)           (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_DEV_PKG1_WIS_SHIFT)) & PMA_MMD_SR_PMA_DEV_PKG1_WIS_MASK)

#define PMA_MMD_SR_PMA_DEV_PKG1_PCS_MASK         (0x8U)
#define PMA_MMD_SR_PMA_DEV_PKG1_PCS_SHIFT        (3U)
#define PMA_MMD_SR_PMA_DEV_PKG1_PCS_WIDTH        (1U)
#define PMA_MMD_SR_PMA_DEV_PKG1_PCS(x)           (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_DEV_PKG1_PCS_SHIFT)) & PMA_MMD_SR_PMA_DEV_PKG1_PCS_MASK)

#define PMA_MMD_SR_PMA_DEV_PKG1_PHYXS_MASK       (0x10U)
#define PMA_MMD_SR_PMA_DEV_PKG1_PHYXS_SHIFT      (4U)
#define PMA_MMD_SR_PMA_DEV_PKG1_PHYXS_WIDTH      (1U)
#define PMA_MMD_SR_PMA_DEV_PKG1_PHYXS(x)         (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_DEV_PKG1_PHYXS_SHIFT)) & PMA_MMD_SR_PMA_DEV_PKG1_PHYXS_MASK)

#define PMA_MMD_SR_PMA_DEV_PKG1_DTEXS_MASK       (0x20U)
#define PMA_MMD_SR_PMA_DEV_PKG1_DTEXS_SHIFT      (5U)
#define PMA_MMD_SR_PMA_DEV_PKG1_DTEXS_WIDTH      (1U)
#define PMA_MMD_SR_PMA_DEV_PKG1_DTEXS(x)         (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_DEV_PKG1_DTEXS_SHIFT)) & PMA_MMD_SR_PMA_DEV_PKG1_DTEXS_MASK)

