zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_PMA_MMD.h
#define PMA_MMD_SR_PMA_DEV_PKG1_TC_MASK          (0x40U)
#define PMA_MMD_SR_PMA_DEV_PKG1_TC_SHIFT         (6U)
#define PMA_MMD_SR_PMA_DEV_PKG1_TC_WIDTH         (1U)
#define PMA_MMD_SR_PMA_DEV_PKG1_TC(x)            (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_DEV_PKG1_TC_SHIFT)) & PMA_MMD_SR_PMA_DEV_PKG1_TC_MASK)

#define PMA_MMD_SR_PMA_DEV_PKG1_AN_MASK          (0x80U)
#define PMA_MMD_SR_PMA_DEV_PKG1_AN_SHIFT         (7U)
#define PMA_MMD_SR_PMA_DEV_PKG1_AN_WIDTH         (1U)
#define PMA_MMD_SR_PMA_DEV_PKG1_AN(x)            (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_DEV_PKG1_AN_SHIFT)) & PMA_MMD_SR_PMA_DEV_PKG1_AN_MASK)
/*! @} */

/*! @name SR_PMA_DEV_PKG2 - SR PMA MMD Devices in Package 2 Register */
/*! @{ */

#define PMA_MMD_SR_PMA_DEV_PKG2_VSD1_MASK        (0x4000U)
#define PMA_MMD_SR_PMA_DEV_PKG2_VSD1_SHIFT       (14U)
#define PMA_MMD_SR_PMA_DEV_PKG2_VSD1_WIDTH       (1U)
#define PMA_MMD_SR_PMA_DEV_PKG2_VSD1(x)          (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_DEV_PKG2_VSD1_SHIFT)) & PMA_MMD_SR_PMA_DEV_PKG2_VSD1_MASK)

#define PMA_MMD_SR_PMA_DEV_PKG2_VSD2_MASK        (0x8000U)
#define PMA_MMD_SR_PMA_DEV_PKG2_VSD2_SHIFT       (15U)
#define PMA_MMD_SR_PMA_DEV_PKG2_VSD2_WIDTH       (1U)
#define PMA_MMD_SR_PMA_DEV_PKG2_VSD2(x)          (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_DEV_PKG2_VSD2_SHIFT)) & PMA_MMD_SR_PMA_DEV_PKG2_VSD2_MASK)
/*! @} */

/*! @name SR_PMA_CTRL2 - SR PMA MMD Control2 Register */
/*! @{ */

#define PMA_MMD_SR_PMA_CTRL2_PMA_TYPE_MASK       (0x3FU)
#define PMA_MMD_SR_PMA_CTRL2_PMA_TYPE_SHIFT      (0U)
#define PMA_MMD_SR_PMA_CTRL2_PMA_TYPE_WIDTH      (6U)
#define PMA_MMD_SR_PMA_CTRL2_PMA_TYPE(x)         (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_CTRL2_PMA_TYPE_SHIFT)) & PMA_MMD_SR_PMA_CTRL2_PMA_TYPE_MASK)
/*! @} */

/*! @name SR_PMA_STATUS2 - SR PMA MMD Status2 Register */
/*! @{ */

#define PMA_MMD_SR_PMA_STATUS2_PMA_LOOP_MASK     (0x1U)
#define PMA_MMD_SR_PMA_STATUS2_PMA_LOOP_SHIFT    (0U)
#define PMA_MMD_SR_PMA_STATUS2_PMA_LOOP_WIDTH    (1U)
#define PMA_MMD_SR_PMA_STATUS2_PMA_LOOP(x)       (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_STATUS2_PMA_LOOP_SHIFT)) & PMA_MMD_SR_PMA_STATUS2_PMA_LOOP_MASK)

#define PMA_MMD_SR_PMA_STATUS2_XGEWEN_MASK       (0x2U)
#define PMA_MMD_SR_PMA_STATUS2_XGEWEN_SHIFT      (1U)
#define PMA_MMD_SR_PMA_STATUS2_XGEWEN_WIDTH      (1U)
#define PMA_MMD_SR_PMA_STATUS2_XGEWEN(x)         (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_STATUS2_XGEWEN_SHIFT)) & PMA_MMD_SR_PMA_STATUS2_XGEWEN_MASK)

#define PMA_MMD_SR_PMA_STATUS2_XGLWEN_MASK       (0x4U)
#define PMA_MMD_SR_PMA_STATUS2_XGLWEN_SHIFT      (2U)
#define PMA_MMD_SR_PMA_STATUS2_XGLWEN_WIDTH      (1U)
#define PMA_MMD_SR_PMA_STATUS2_XGLWEN(x)         (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_STATUS2_XGLWEN_SHIFT)) & PMA_MMD_SR_PMA_STATUS2_XGLWEN_MASK)

#define PMA_MMD_SR_PMA_STATUS2_XGSWEN_MASK       (0x8U)
#define PMA_MMD_SR_PMA_STATUS2_XGSWEN_SHIFT      (3U)
#define PMA_MMD_SR_PMA_STATUS2_XGSWEN_WIDTH      (1U)
#define PMA_MMD_SR_PMA_STATUS2_XGSWEN(x)         (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_STATUS2_XGSWEN_SHIFT)) & PMA_MMD_SR_PMA_STATUS2_XGSWEN_MASK)

#define PMA_MMD_SR_PMA_STATUS2_LX4_ABL_MASK      (0x10U)
#define PMA_MMD_SR_PMA_STATUS2_LX4_ABL_SHIFT     (4U)
#define PMA_MMD_SR_PMA_STATUS2_LX4_ABL_WIDTH     (1U)
#define PMA_MMD_SR_PMA_STATUS2_LX4_ABL(x)        (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_STATUS2_LX4_ABL_SHIFT)) & PMA_MMD_SR_PMA_STATUS2_LX4_ABL_MASK)

#define PMA_MMD_SR_PMA_STATUS2_ER_ABL_MASK       (0x20U)
#define PMA_MMD_SR_PMA_STATUS2_ER_ABL_SHIFT      (5U)
#define PMA_MMD_SR_PMA_STATUS2_ER_ABL_WIDTH      (1U)
#define PMA_MMD_SR_PMA_STATUS2_ER_ABL(x)         (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_STATUS2_ER_ABL_SHIFT)) & PMA_MMD_SR_PMA_STATUS2_ER_ABL_MASK)

#define PMA_MMD_SR_PMA_STATUS2_LR_ABL_MASK       (0x40U)
#define PMA_MMD_SR_PMA_STATUS2_LR_ABL_SHIFT      (6U)
#define PMA_MMD_SR_PMA_STATUS2_LR_ABL_WIDTH      (1U)
#define PMA_MMD_SR_PMA_STATUS2_LR_ABL(x)         (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_STATUS2_LR_ABL_SHIFT)) & PMA_MMD_SR_PMA_STATUS2_LR_ABL_MASK)

#define PMA_MMD_SR_PMA_STATUS2_SR_ABL_MASK       (0x80U)
#define PMA_MMD_SR_PMA_STATUS2_SR_ABL_SHIFT      (7U)
#define PMA_MMD_SR_PMA_STATUS2_SR_ABL_WIDTH      (1U)
#define PMA_MMD_SR_PMA_STATUS2_SR_ABL(x)         (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_STATUS2_SR_ABL_SHIFT)) & PMA_MMD_SR_PMA_STATUS2_SR_ABL_MASK)

#define PMA_MMD_SR_PMA_STATUS2_TD_ABL_MASK       (0x100U)
#define PMA_MMD_SR_PMA_STATUS2_TD_ABL_SHIFT      (8U)
#define PMA_MMD_SR_PMA_STATUS2_TD_ABL_WIDTH      (1U)
#define PMA_MMD_SR_PMA_STATUS2_TD_ABL(x)         (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_STATUS2_TD_ABL_SHIFT)) & PMA_MMD_SR_PMA_STATUS2_TD_ABL_MASK)

#define PMA_MMD_SR_PMA_STATUS2_RF_MASK           (0x400U)
#define PMA_MMD_SR_PMA_STATUS2_RF_SHIFT          (10U)
#define PMA_MMD_SR_PMA_STATUS2_RF_WIDTH          (1U)
#define PMA_MMD_SR_PMA_STATUS2_RF(x)             (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_STATUS2_RF_SHIFT)) & PMA_MMD_SR_PMA_STATUS2_RF_MASK)

#define PMA_MMD_SR_PMA_STATUS2_TF_MASK           (0x800U)
#define PMA_MMD_SR_PMA_STATUS2_TF_SHIFT          (11U)
#define PMA_MMD_SR_PMA_STATUS2_TF_WIDTH          (1U)
#define PMA_MMD_SR_PMA_STATUS2_TF(x)             (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_STATUS2_TF_SHIFT)) & PMA_MMD_SR_PMA_STATUS2_TF_MASK)

#define PMA_MMD_SR_PMA_STATUS2_PRFA_MASK         (0x1000U)
#define PMA_MMD_SR_PMA_STATUS2_PRFA_SHIFT        (12U)
#define PMA_MMD_SR_PMA_STATUS2_PRFA_WIDTH        (1U)
#define PMA_MMD_SR_PMA_STATUS2_PRFA(x)           (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_STATUS2_PRFA_SHIFT)) & PMA_MMD_SR_PMA_STATUS2_PRFA_MASK)

#define PMA_MMD_SR_PMA_STATUS2_PTFA_MASK         (0x2000U)
#define PMA_MMD_SR_PMA_STATUS2_PTFA_SHIFT        (13U)
#define PMA_MMD_SR_PMA_STATUS2_PTFA_WIDTH        (1U)
#define PMA_MMD_SR_PMA_STATUS2_PTFA(x)           (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_STATUS2_PTFA_SHIFT)) & PMA_MMD_SR_PMA_STATUS2_PTFA_MASK)

#define PMA_MMD_SR_PMA_STATUS2_DP_MASK           (0xC000U)
#define PMA_MMD_SR_PMA_STATUS2_DP_SHIFT          (14U)
#define PMA_MMD_SR_PMA_STATUS2_DP_WIDTH          (2U)
#define PMA_MMD_SR_PMA_STATUS2_DP(x)             (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_STATUS2_DP_SHIFT)) & PMA_MMD_SR_PMA_STATUS2_DP_MASK)
/*! @} */

/*! @name SR_PMA_TX_DIS - SR_PMA_TX_DIS */
/*! @{ */

#define PMA_MMD_SR_PMA_TX_DIS_GTD_MASK           (0x1U)
#define PMA_MMD_SR_PMA_TX_DIS_GTD_SHIFT          (0U)
#define PMA_MMD_SR_PMA_TX_DIS_GTD_WIDTH          (1U)
#define PMA_MMD_SR_PMA_TX_DIS_GTD(x)             (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_TX_DIS_GTD_SHIFT)) & PMA_MMD_SR_PMA_TX_DIS_GTD_MASK)

