zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_PMA_MMD.h
#define PMA_MMD_SR_PMA_TX_DIS_PMA_TX_DIS_0_MASK  (0x2U)
#define PMA_MMD_SR_PMA_TX_DIS_PMA_TX_DIS_0_SHIFT (1U)
#define PMA_MMD_SR_PMA_TX_DIS_PMA_TX_DIS_0_WIDTH (1U)
#define PMA_MMD_SR_PMA_TX_DIS_PMA_TX_DIS_0(x)    (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_TX_DIS_PMA_TX_DIS_0_SHIFT)) & PMA_MMD_SR_PMA_TX_DIS_PMA_TX_DIS_0_MASK)
/*! @} */

/*! @name SR_PMA_RX_SIG_DET - SR PMA MMD Receive Signal Detect Register */
/*! @{ */

#define PMA_MMD_SR_PMA_RX_SIG_DET_RX_DET_MASK    (0x1U)
#define PMA_MMD_SR_PMA_RX_SIG_DET_RX_DET_SHIFT   (0U)
#define PMA_MMD_SR_PMA_RX_SIG_DET_RX_DET_WIDTH   (1U)
#define PMA_MMD_SR_PMA_RX_SIG_DET_RX_DET(x)      (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_RX_SIG_DET_RX_DET_SHIFT)) & PMA_MMD_SR_PMA_RX_SIG_DET_RX_DET_MASK)

#define PMA_MMD_SR_PMA_RX_SIG_DET_PMA_RX_DET_0_MASK (0x2U)
#define PMA_MMD_SR_PMA_RX_SIG_DET_PMA_RX_DET_0_SHIFT (1U)
#define PMA_MMD_SR_PMA_RX_SIG_DET_PMA_RX_DET_0_WIDTH (1U)
#define PMA_MMD_SR_PMA_RX_SIG_DET_PMA_RX_DET_0(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_RX_SIG_DET_PMA_RX_DET_0_SHIFT)) & PMA_MMD_SR_PMA_RX_SIG_DET_PMA_RX_DET_0_MASK)
/*! @} */

/*! @name SR_PMA_EXT_ABL - SR PMA or PMD Extended Ability Register */
/*! @{ */

#define PMA_MMD_SR_PMA_EXT_ABL_XGBCX4_ABL_MASK   (0x1U)
#define PMA_MMD_SR_PMA_EXT_ABL_XGBCX4_ABL_SHIFT  (0U)
#define PMA_MMD_SR_PMA_EXT_ABL_XGBCX4_ABL_WIDTH  (1U)
#define PMA_MMD_SR_PMA_EXT_ABL_XGBCX4_ABL(x)     (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_EXT_ABL_XGBCX4_ABL_SHIFT)) & PMA_MMD_SR_PMA_EXT_ABL_XGBCX4_ABL_MASK)

#define PMA_MMD_SR_PMA_EXT_ABL_XGBLRM_ABL_MASK   (0x2U)
#define PMA_MMD_SR_PMA_EXT_ABL_XGBLRM_ABL_SHIFT  (1U)
#define PMA_MMD_SR_PMA_EXT_ABL_XGBLRM_ABL_WIDTH  (1U)
#define PMA_MMD_SR_PMA_EXT_ABL_XGBLRM_ABL(x)     (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_EXT_ABL_XGBLRM_ABL_SHIFT)) & PMA_MMD_SR_PMA_EXT_ABL_XGBLRM_ABL_MASK)

#define PMA_MMD_SR_PMA_EXT_ABL_XGBT_ABL_MASK     (0x4U)
#define PMA_MMD_SR_PMA_EXT_ABL_XGBT_ABL_SHIFT    (2U)
#define PMA_MMD_SR_PMA_EXT_ABL_XGBT_ABL_WIDTH    (1U)
#define PMA_MMD_SR_PMA_EXT_ABL_XGBT_ABL(x)       (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_EXT_ABL_XGBT_ABL_SHIFT)) & PMA_MMD_SR_PMA_EXT_ABL_XGBT_ABL_MASK)

#define PMA_MMD_SR_PMA_EXT_ABL_XGKX4_ABL_MASK    (0x8U)
#define PMA_MMD_SR_PMA_EXT_ABL_XGKX4_ABL_SHIFT   (3U)
#define PMA_MMD_SR_PMA_EXT_ABL_XGKX4_ABL_WIDTH   (1U)
#define PMA_MMD_SR_PMA_EXT_ABL_XGKX4_ABL(x)      (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_EXT_ABL_XGKX4_ABL_SHIFT)) & PMA_MMD_SR_PMA_EXT_ABL_XGKX4_ABL_MASK)

#define PMA_MMD_SR_PMA_EXT_ABL_XGBKR_ABL_MASK    (0x10U)
#define PMA_MMD_SR_PMA_EXT_ABL_XGBKR_ABL_SHIFT   (4U)
#define PMA_MMD_SR_PMA_EXT_ABL_XGBKR_ABL_WIDTH   (1U)
#define PMA_MMD_SR_PMA_EXT_ABL_XGBKR_ABL(x)      (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_EXT_ABL_XGBKR_ABL_SHIFT)) & PMA_MMD_SR_PMA_EXT_ABL_XGBKR_ABL_MASK)

#define PMA_MMD_SR_PMA_EXT_ABL_GBT_ABL_MASK      (0x20U)
#define PMA_MMD_SR_PMA_EXT_ABL_GBT_ABL_SHIFT     (5U)
#define PMA_MMD_SR_PMA_EXT_ABL_GBT_ABL_WIDTH     (1U)
#define PMA_MMD_SR_PMA_EXT_ABL_GBT_ABL(x)        (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_EXT_ABL_GBT_ABL_SHIFT)) & PMA_MMD_SR_PMA_EXT_ABL_GBT_ABL_MASK)

#define PMA_MMD_SR_PMA_EXT_ABL_R_100BKX_ABL_MASK (0x40U)
#define PMA_MMD_SR_PMA_EXT_ABL_R_100BKX_ABL_SHIFT (6U)
#define PMA_MMD_SR_PMA_EXT_ABL_R_100BKX_ABL_WIDTH (1U)
#define PMA_MMD_SR_PMA_EXT_ABL_R_100BKX_ABL(x)   (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_EXT_ABL_R_100BKX_ABL_SHIFT)) & PMA_MMD_SR_PMA_EXT_ABL_R_100BKX_ABL_MASK)

#define PMA_MMD_SR_PMA_EXT_ABL_R_100BT_ABL_MASK  (0x80U)
#define PMA_MMD_SR_PMA_EXT_ABL_R_100BT_ABL_SHIFT (7U)
#define PMA_MMD_SR_PMA_EXT_ABL_R_100BT_ABL_WIDTH (1U)
#define PMA_MMD_SR_PMA_EXT_ABL_R_100BT_ABL(x)    (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_EXT_ABL_R_100BT_ABL_SHIFT)) & PMA_MMD_SR_PMA_EXT_ABL_R_100BT_ABL_MASK)

#define PMA_MMD_SR_PMA_EXT_ABL_R_10BT_ABL_MASK   (0x100U)
#define PMA_MMD_SR_PMA_EXT_ABL_R_10BT_ABL_SHIFT  (8U)
#define PMA_MMD_SR_PMA_EXT_ABL_R_10BT_ABL_WIDTH  (1U)
#define PMA_MMD_SR_PMA_EXT_ABL_R_10BT_ABL(x)     (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_EXT_ABL_R_10BT_ABL_SHIFT)) & PMA_MMD_SR_PMA_EXT_ABL_R_10BT_ABL_MASK)
/*! @} */

/*! @name SR_PMA_PKG1 - SR PMA MMD Package Identifier 1 Register */
/*! @{ */

#define PMA_MMD_SR_PMA_PKG1_PMA_PKG_OUI_3_18_MASK (0xFFFFU)
#define PMA_MMD_SR_PMA_PKG1_PMA_PKG_OUI_3_18_SHIFT (0U)
#define PMA_MMD_SR_PMA_PKG1_PMA_PKG_OUI_3_18_WIDTH (16U)
#define PMA_MMD_SR_PMA_PKG1_PMA_PKG_OUI_3_18(x)  (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_PKG1_PMA_PKG_OUI_3_18_SHIFT)) & PMA_MMD_SR_PMA_PKG1_PMA_PKG_OUI_3_18_MASK)
/*! @} */

/*! @name SR_PMA_PKG2 - SR PMA MMD Package Identifier 2 Register */
/*! @{ */

#define PMA_MMD_SR_PMA_PKG2_PMA_PKG_RN_3_0_MASK  (0xFU)
#define PMA_MMD_SR_PMA_PKG2_PMA_PKG_RN_3_0_SHIFT (0U)
#define PMA_MMD_SR_PMA_PKG2_PMA_PKG_RN_3_0_WIDTH (4U)
#define PMA_MMD_SR_PMA_PKG2_PMA_PKG_RN_3_0(x)    (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_PKG2_PMA_PKG_RN_3_0_SHIFT)) & PMA_MMD_SR_PMA_PKG2_PMA_PKG_RN_3_0_MASK)

#define PMA_MMD_SR_PMA_PKG2_PMA_PKG_MMN_5_0_MASK (0x3F0U)
#define PMA_MMD_SR_PMA_PKG2_PMA_PKG_MMN_5_0_SHIFT (4U)
#define PMA_MMD_SR_PMA_PKG2_PMA_PKG_MMN_5_0_WIDTH (6U)
#define PMA_MMD_SR_PMA_PKG2_PMA_PKG_MMN_5_0(x)   (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_PKG2_PMA_PKG_MMN_5_0_SHIFT)) & PMA_MMD_SR_PMA_PKG2_PMA_PKG_MMN_5_0_MASK)

#define PMA_MMD_SR_PMA_PKG2_PMA_PKG_OUI_19_24_MASK (0xFC00U)
#define PMA_MMD_SR_PMA_PKG2_PMA_PKG_OUI_19_24_SHIFT (10U)
#define PMA_MMD_SR_PMA_PKG2_PMA_PKG_OUI_19_24_WIDTH (6U)
#define PMA_MMD_SR_PMA_PKG2_PMA_PKG_OUI_19_24(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_PKG2_PMA_PKG_OUI_19_24_SHIFT)) & PMA_MMD_SR_PMA_PKG2_PMA_PKG_OUI_19_24_MASK)
/*! @} */

/*! @name SR_PMA_2PT5G_5G_EXT_ABL - SR PMA MMD 2. */
/*! @{ */

#define PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_2PT5GT_MASK (0x1U)
#define PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_2PT5GT_SHIFT (0U)
#define PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_2PT5GT_WIDTH (1U)
#define PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_2PT5GT(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_2PT5GT_SHIFT)) & PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_2PT5GT_MASK)

