zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_PMA_MMD.h
#define PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_5GT_MASK (0x2U)
#define PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_5GT_SHIFT (1U)
#define PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_5GT_WIDTH (1U)
#define PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_5GT(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_5GT_SHIFT)) & PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_5GT_MASK)

#define PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_2PT5GKX_MASK (0x4U)
#define PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_2PT5GKX_SHIFT (2U)
#define PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_2PT5GKX_WIDTH (1U)
#define PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_2PT5GKX(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_2PT5GKX_SHIFT)) & PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_2PT5GKX_MASK)

#define PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_5GKR_MASK (0x8U)
#define PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_5GKR_SHIFT (3U)
#define PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_5GKR_WIDTH (1U)
#define PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_5GKR(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_5GKR_SHIFT)) & PMA_MMD_SR_PMA_2PT5G_5G_EXT_ABL_ABL_5GKR_MASK)
/*! @} */

/*! @name SR_PMA_KX_CTRL - SR PMA or PMD KX Control Register This register is present only in the configurations with KX_Present mode. */
/*! @{ */

#define PMA_MMD_SR_PMA_KX_CTRL_TOC_MASK          (0x1U)
#define PMA_MMD_SR_PMA_KX_CTRL_TOC_SHIFT         (0U)
#define PMA_MMD_SR_PMA_KX_CTRL_TOC_WIDTH         (1U)
#define PMA_MMD_SR_PMA_KX_CTRL_TOC(x)            (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_KX_CTRL_TOC_SHIFT)) & PMA_MMD_SR_PMA_KX_CTRL_TOC_MASK)
/*! @} */

/*! @name SR_PMA_KX_STS - SR PMA or PMD KX Status Register This register is present only in the configurations with KX_Present mode. */
/*! @{ */

#define PMA_MMD_SR_PMA_KX_STS_SD_MASK            (0x1U)
#define PMA_MMD_SR_PMA_KX_STS_SD_SHIFT           (0U)
#define PMA_MMD_SR_PMA_KX_STS_SD_WIDTH           (1U)
#define PMA_MMD_SR_PMA_KX_STS_SD(x)              (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_KX_STS_SD_SHIFT)) & PMA_MMD_SR_PMA_KX_STS_SD_MASK)

#define PMA_MMD_SR_PMA_KX_STS_PMA_TDA_MASK       (0x100U)
#define PMA_MMD_SR_PMA_KX_STS_PMA_TDA_SHIFT      (8U)
#define PMA_MMD_SR_PMA_KX_STS_PMA_TDA_WIDTH      (1U)
#define PMA_MMD_SR_PMA_KX_STS_PMA_TDA(x)         (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_KX_STS_PMA_TDA_SHIFT)) & PMA_MMD_SR_PMA_KX_STS_PMA_TDA_MASK)

#define PMA_MMD_SR_PMA_KX_STS_RX_F_MASK          (0x400U)
#define PMA_MMD_SR_PMA_KX_STS_RX_F_SHIFT         (10U)
#define PMA_MMD_SR_PMA_KX_STS_RX_F_WIDTH         (1U)
#define PMA_MMD_SR_PMA_KX_STS_RX_F(x)            (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_KX_STS_RX_F_SHIFT)) & PMA_MMD_SR_PMA_KX_STS_RX_F_MASK)

#define PMA_MMD_SR_PMA_KX_STS_TX_F_MASK          (0x800U)
#define PMA_MMD_SR_PMA_KX_STS_TX_F_SHIFT         (11U)
#define PMA_MMD_SR_PMA_KX_STS_TX_F_WIDTH         (1U)
#define PMA_MMD_SR_PMA_KX_STS_TX_F(x)            (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_KX_STS_TX_F_SHIFT)) & PMA_MMD_SR_PMA_KX_STS_TX_F_MASK)

#define PMA_MMD_SR_PMA_KX_STS_RFA_MASK           (0x1000U)
#define PMA_MMD_SR_PMA_KX_STS_RFA_SHIFT          (12U)
#define PMA_MMD_SR_PMA_KX_STS_RFA_WIDTH          (1U)
#define PMA_MMD_SR_PMA_KX_STS_RFA(x)             (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_KX_STS_RFA_SHIFT)) & PMA_MMD_SR_PMA_KX_STS_RFA_MASK)

#define PMA_MMD_SR_PMA_KX_STS_TFA_MASK           (0x2000U)
#define PMA_MMD_SR_PMA_KX_STS_TFA_SHIFT          (13U)
#define PMA_MMD_SR_PMA_KX_STS_TFA_WIDTH          (1U)
#define PMA_MMD_SR_PMA_KX_STS_TFA(x)             (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_KX_STS_TFA_SHIFT)) & PMA_MMD_SR_PMA_KX_STS_TFA_MASK)
/*! @} */

/*! @name SR_PMA_TIME_SYNC_PMA_ABL - SR PMA MMD Time Sync Capability Register */
/*! @{ */

#define PMA_MMD_SR_PMA_TIME_SYNC_PMA_ABL_PMA_RX_DLY_ABL_MASK (0x1U)
#define PMA_MMD_SR_PMA_TIME_SYNC_PMA_ABL_PMA_RX_DLY_ABL_SHIFT (0U)
#define PMA_MMD_SR_PMA_TIME_SYNC_PMA_ABL_PMA_RX_DLY_ABL_WIDTH (1U)
#define PMA_MMD_SR_PMA_TIME_SYNC_PMA_ABL_PMA_RX_DLY_ABL(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_TIME_SYNC_PMA_ABL_PMA_RX_DLY_ABL_SHIFT)) & PMA_MMD_SR_PMA_TIME_SYNC_PMA_ABL_PMA_RX_DLY_ABL_MASK)

#define PMA_MMD_SR_PMA_TIME_SYNC_PMA_ABL_PMA_TX_DLY_ABL_MASK (0x2U)
#define PMA_MMD_SR_PMA_TIME_SYNC_PMA_ABL_PMA_TX_DLY_ABL_SHIFT (1U)
#define PMA_MMD_SR_PMA_TIME_SYNC_PMA_ABL_PMA_TX_DLY_ABL_WIDTH (1U)
#define PMA_MMD_SR_PMA_TIME_SYNC_PMA_ABL_PMA_TX_DLY_ABL(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_TIME_SYNC_PMA_ABL_PMA_TX_DLY_ABL_SHIFT)) & PMA_MMD_SR_PMA_TIME_SYNC_PMA_ABL_PMA_TX_DLY_ABL_MASK)
/*! @} */

/*! @name SR_PMA_TIME_SYNC_TX_MAX_DLY_LWR - SR PMA MMD Time Sync Tx Max Delay Lower Register */
/*! @{ */

#define PMA_MMD_SR_PMA_TIME_SYNC_TX_MAX_DLY_LWR_PMA_TX_MAX_DLY_LWR_MASK (0xFFFFU)
#define PMA_MMD_SR_PMA_TIME_SYNC_TX_MAX_DLY_LWR_PMA_TX_MAX_DLY_LWR_SHIFT (0U)
#define PMA_MMD_SR_PMA_TIME_SYNC_TX_MAX_DLY_LWR_PMA_TX_MAX_DLY_LWR_WIDTH (16U)
#define PMA_MMD_SR_PMA_TIME_SYNC_TX_MAX_DLY_LWR_PMA_TX_MAX_DLY_LWR(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_TIME_SYNC_TX_MAX_DLY_LWR_PMA_TX_MAX_DLY_LWR_SHIFT)) & PMA_MMD_SR_PMA_TIME_SYNC_TX_MAX_DLY_LWR_PMA_TX_MAX_DLY_LWR_MASK)
/*! @} */

/*! @name SR_PMA_TIME_SYNC_TX_MAX_DLY_UPR - SR PMA MMD Time Sync Tx Max Delay Upper Register */
/*! @{ */

#define PMA_MMD_SR_PMA_TIME_SYNC_TX_MAX_DLY_UPR_PMA_TX_MAX_DLY_UPR_MASK (0xFFFFU)
#define PMA_MMD_SR_PMA_TIME_SYNC_TX_MAX_DLY_UPR_PMA_TX_MAX_DLY_UPR_SHIFT (0U)
#define PMA_MMD_SR_PMA_TIME_SYNC_TX_MAX_DLY_UPR_PMA_TX_MAX_DLY_UPR_WIDTH (16U)
#define PMA_MMD_SR_PMA_TIME_SYNC_TX_MAX_DLY_UPR_PMA_TX_MAX_DLY_UPR(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_TIME_SYNC_TX_MAX_DLY_UPR_PMA_TX_MAX_DLY_UPR_SHIFT)) & PMA_MMD_SR_PMA_TIME_SYNC_TX_MAX_DLY_UPR_PMA_TX_MAX_DLY_UPR_MASK)
/*! @} */

/*! @name SR_PMA_TIME_SYNC_TX_MIN_DLY_LWR - SR PMA MMD Time Sync Tx Min Delay Lower Register */
/*! @{ */

#define PMA_MMD_SR_PMA_TIME_SYNC_TX_MIN_DLY_LWR_PMA_TX_MIN_DLY_LWR_MASK (0xFFFFU)
#define PMA_MMD_SR_PMA_TIME_SYNC_TX_MIN_DLY_LWR_PMA_TX_MIN_DLY_LWR_SHIFT (0U)
#define PMA_MMD_SR_PMA_TIME_SYNC_TX_MIN_DLY_LWR_PMA_TX_MIN_DLY_LWR_WIDTH (16U)
#define PMA_MMD_SR_PMA_TIME_SYNC_TX_MIN_DLY_LWR_PMA_TX_MIN_DLY_LWR(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_TIME_SYNC_TX_MIN_DLY_LWR_PMA_TX_MIN_DLY_LWR_SHIFT)) & PMA_MMD_SR_PMA_TIME_SYNC_TX_MIN_DLY_LWR_PMA_TX_MIN_DLY_LWR_MASK)
/*! @} */

/*! @name SR_PMA_TIME_SYNC_TX_MIN_DLY_UPR - SR PMA MMD Time Sync Tx Min Delay Upper Register */
/*! @{ */

#define PMA_MMD_SR_PMA_TIME_SYNC_TX_MIN_DLY_UPR_PMA_TX_MIN_DLY_UPR_MASK (0xFFFFU)
#define PMA_MMD_SR_PMA_TIME_SYNC_TX_MIN_DLY_UPR_PMA_TX_MIN_DLY_UPR_SHIFT (0U)
#define PMA_MMD_SR_PMA_TIME_SYNC_TX_MIN_DLY_UPR_PMA_TX_MIN_DLY_UPR_WIDTH (16U)
#define PMA_MMD_SR_PMA_TIME_SYNC_TX_MIN_DLY_UPR_PMA_TX_MIN_DLY_UPR(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_TIME_SYNC_TX_MIN_DLY_UPR_PMA_TX_MIN_DLY_UPR_SHIFT)) & PMA_MMD_SR_PMA_TIME_SYNC_TX_MIN_DLY_UPR_PMA_TX_MIN_DLY_UPR_MASK)
/*! @} */

/*! @name SR_PMA_TIME_SYNC_RX_MAX_DLY_LWR - SR PMA MMD Time Sync Rx Max Delay Lower Register */
/*! @{ */

#define PMA_MMD_SR_PMA_TIME_SYNC_RX_MAX_DLY_LWR_PMA_RX_MAX_DLY_LWR_MASK (0xFFFFU)
#define PMA_MMD_SR_PMA_TIME_SYNC_RX_MAX_DLY_LWR_PMA_RX_MAX_DLY_LWR_SHIFT (0U)
#define PMA_MMD_SR_PMA_TIME_SYNC_RX_MAX_DLY_LWR_PMA_RX_MAX_DLY_LWR_WIDTH (16U)
#define PMA_MMD_SR_PMA_TIME_SYNC_RX_MAX_DLY_LWR_PMA_RX_MAX_DLY_LWR(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_TIME_SYNC_RX_MAX_DLY_LWR_PMA_RX_MAX_DLY_LWR_SHIFT)) & PMA_MMD_SR_PMA_TIME_SYNC_RX_MAX_DLY_LWR_PMA_RX_MAX_DLY_LWR_MASK)
/*! @} */

/*! @name SR_PMA_TIME_SYNC_RX_MAX_DLY_UPR - SR PMA MMD Time Sync Rx Max Delay Upper Register */
/*! @{ */

#define PMA_MMD_SR_PMA_TIME_SYNC_RX_MAX_DLY_UPR_PMA_RX_MAX_DLY_UPR_MASK (0xFFFFU)
#define PMA_MMD_SR_PMA_TIME_SYNC_RX_MAX_DLY_UPR_PMA_RX_MAX_DLY_UPR_SHIFT (0U)
#define PMA_MMD_SR_PMA_TIME_SYNC_RX_MAX_DLY_UPR_PMA_RX_MAX_DLY_UPR_WIDTH (16U)
#define PMA_MMD_SR_PMA_TIME_SYNC_RX_MAX_DLY_UPR_PMA_RX_MAX_DLY_UPR(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_TIME_SYNC_RX_MAX_DLY_UPR_PMA_RX_MAX_DLY_UPR_SHIFT)) & PMA_MMD_SR_PMA_TIME_SYNC_RX_MAX_DLY_UPR_PMA_RX_MAX_DLY_UPR_MASK)
/*! @} */

/*! @name SR_PMA_TIME_SYNC_RX_MIN_DLY_LWR - SR PMA MMD Time Sync Rx Min Delay Lower Register */
/*! @{ */

#define PMA_MMD_SR_PMA_TIME_SYNC_RX_MIN_DLY_LWR_PMA_RX_MIN_DLY_LWR_MASK (0xFFFFU)
#define PMA_MMD_SR_PMA_TIME_SYNC_RX_MIN_DLY_LWR_PMA_RX_MIN_DLY_LWR_SHIFT (0U)
#define PMA_MMD_SR_PMA_TIME_SYNC_RX_MIN_DLY_LWR_PMA_RX_MIN_DLY_LWR_WIDTH (16U)
#define PMA_MMD_SR_PMA_TIME_SYNC_RX_MIN_DLY_LWR_PMA_RX_MIN_DLY_LWR(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_TIME_SYNC_RX_MIN_DLY_LWR_PMA_RX_MIN_DLY_LWR_SHIFT)) & PMA_MMD_SR_PMA_TIME_SYNC_RX_MIN_DLY_LWR_PMA_RX_MIN_DLY_LWR_MASK)
/*! @} */

/*! @name SR_PMA_TIME_SYNC_RX_MIN_DLY_UPR - SR PMA MMD Time Sync Rx Min Delay Upper Register */
/*! @{ */

