zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_PMA_MMD.h
#define PMA_MMD_SR_PMA_TIME_SYNC_RX_MIN_DLY_UPR_PMA_RX_MIN_DLY_UPR_MASK (0xFFFFU)
#define PMA_MMD_SR_PMA_TIME_SYNC_RX_MIN_DLY_UPR_PMA_RX_MIN_DLY_UPR_SHIFT (0U)
#define PMA_MMD_SR_PMA_TIME_SYNC_RX_MIN_DLY_UPR_PMA_RX_MIN_DLY_UPR_WIDTH (16U)
#define PMA_MMD_SR_PMA_TIME_SYNC_RX_MIN_DLY_UPR_PMA_RX_MIN_DLY_UPR(x) (((uint16_t)(((uint16_t)(x)) << PMA_MMD_SR_PMA_TIME_SYNC_RX_MIN_DLY_UPR_PMA_RX_MIN_DLY_UPR_SHIFT)) & PMA_MMD_SR_PMA_TIME_SYNC_RX_MIN_DLY_UPR_PMA_RX_MIN_DLY_UPR_MASK)
/*! @} */

/*! @name VR_PMA_DIG_CTRL1 - VR PMA MMD Digital Control1 Register */
/*! @{ */

#define PMA_MMD_VR_PMA_DIG_CTRL1_CL72_AUTO_MASK  (0x1U)
#define PMA_MMD_VR_PMA_DIG_CTRL1_CL72_AUTO_SHIFT (0U)
#define PMA_MMD_VR_PMA_DIG_CTRL1_CL72_AUTO_WIDTH (1U)
#define PMA_MMD_VR_PMA_DIG_CTRL1_CL72_AUTO(x)    (((uint16_t)(((uint16_t)(x)) << PMA_MMD_VR_PMA_DIG_CTRL1_CL72_AUTO_SHIFT)) & PMA_MMD_VR_PMA_DIG_CTRL1_CL72_AUTO_MASK)

#define PMA_MMD_VR_PMA_DIG_CTRL1_BYP_PWRUP_MASK  (0x2U)
#define PMA_MMD_VR_PMA_DIG_CTRL1_BYP_PWRUP_SHIFT (1U)
#define PMA_MMD_VR_PMA_DIG_CTRL1_BYP_PWRUP_WIDTH (1U)
#define PMA_MMD_VR_PMA_DIG_CTRL1_BYP_PWRUP(x)    (((uint16_t)(((uint16_t)(x)) << PMA_MMD_VR_PMA_DIG_CTRL1_BYP_PWRUP_SHIFT)) & PMA_MMD_VR_PMA_DIG_CTRL1_BYP_PWRUP_MASK)

#define PMA_MMD_VR_PMA_DIG_CTRL1_DTXLANED_0_MASK (0x10U)
#define PMA_MMD_VR_PMA_DIG_CTRL1_DTXLANED_0_SHIFT (4U)
#define PMA_MMD_VR_PMA_DIG_CTRL1_DTXLANED_0_WIDTH (1U)
#define PMA_MMD_VR_PMA_DIG_CTRL1_DTXLANED_0(x)   (((uint16_t)(((uint16_t)(x)) << PMA_MMD_VR_PMA_DIG_CTRL1_DTXLANED_0_SHIFT)) & PMA_MMD_VR_PMA_DIG_CTRL1_DTXLANED_0_MASK)

#define PMA_MMD_VR_PMA_DIG_CTRL1_PWRSV_MASK      (0x800U)
#define PMA_MMD_VR_PMA_DIG_CTRL1_PWRSV_SHIFT     (11U)
#define PMA_MMD_VR_PMA_DIG_CTRL1_PWRSV_WIDTH     (1U)
#define PMA_MMD_VR_PMA_DIG_CTRL1_PWRSV(x)        (((uint16_t)(((uint16_t)(x)) << PMA_MMD_VR_PMA_DIG_CTRL1_PWRSV_SHIFT)) & PMA_MMD_VR_PMA_DIG_CTRL1_PWRSV_MASK)

#define PMA_MMD_VR_PMA_DIG_CTRL1_VR_RST_MASK     (0x8000U)
#define PMA_MMD_VR_PMA_DIG_CTRL1_VR_RST_SHIFT    (15U)
#define PMA_MMD_VR_PMA_DIG_CTRL1_VR_RST_WIDTH    (1U)
#define PMA_MMD_VR_PMA_DIG_CTRL1_VR_RST(x)       (((uint16_t)(((uint16_t)(x)) << PMA_MMD_VR_PMA_DIG_CTRL1_VR_RST_SHIFT)) & PMA_MMD_VR_PMA_DIG_CTRL1_VR_RST_MASK)
/*! @} */

/*! @name VR_PMA_DIG_STS - VR PMA MMD Digital Status Register */
/*! @{ */

#define PMA_MMD_VR_PMA_DIG_STS_PSEQ_STATE_MASK   (0x1CU)
#define PMA_MMD_VR_PMA_DIG_STS_PSEQ_STATE_SHIFT  (2U)
#define PMA_MMD_VR_PMA_DIG_STS_PSEQ_STATE_WIDTH  (3U)
#define PMA_MMD_VR_PMA_DIG_STS_PSEQ_STATE(x)     (((uint16_t)(((uint16_t)(x)) << PMA_MMD_VR_PMA_DIG_STS_PSEQ_STATE_SHIFT)) & PMA_MMD_VR_PMA_DIG_STS_PSEQ_STATE_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group PMA_MMD_Register_Masks */

/*!
 * @}
 */ /* end of group PMA_MMD_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_PMA_MMD_H_) */
